Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
/** Loader for iMXRT-Family
Copyright (C) 2019-2021  Markus Klein
https://github.com/Masmiseim36/iMXRT

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice,
   this list of conditions and the following disclaimer.

THIS SOFTWARE IS PROVIDED BY THE AUTHOR "AS IS" AND ANY EXPRESS OR IMPLIED
WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE. */


#include "libmem_driver_xSPI.h"
#include "libmem_Tools.h"
#include "fsl_device_registers.h"
#include "fsl_flexspi.h"
#include "fsl_common.h"
#include "fsl_clock.h"
#include "DebugPrint.h"

static libmem_driver_paged_write_ctrlblk_t paged_write_ctrlblk;


enum LUT_CommandOffsets
{
	LUT_ReadArray       = 0,
	LUT_ReadStatus      = 1,
	LUT_ReadJEDEC_ID    = 2,
	LUT_WriteEnable     = 3,
	LUT_ProgramPage     = 4,

	LUT_EraseSector     = 5,	// BLOCK_ERASE_4K
	LUT_EraseChip       = 6,

	LUT_EnterQPI        = 7,
	LUT_ReturnSPI       = 7,
	LUT_EnterQPI_Atmel  = 10,
	LUT_EnterQPI_ISSI   = 12,

	LUT_WriteStatusReg_Adesto    = 8,
	LUT_WriteConfigReg_Macronix  = 9,
	LUT_WriteConfigReg_Winbond   = 11,
	LUT_WriteConfigReg1_Macronix = 13,
};

static flexspi_device_config_t deviceconfig =
{
	.flexspiRootClk       = 0, // SPI root clock (will be set up later)
	.isSck2Enabled        = false,
	.flashSize            = BOARD_FLASH_SIZE / 1024, // expressed in KByte
	.CSIntervalUnit       = kFLEXSPI_CsIntervalUnit1SckCycle,
	.CSInterval           = 2,
	.CSHoldTime           = 3,
	.CSSetupTime          = 3,
	.dataValidTime        = 0,
	.columnspace          = 0, // we don't use colums
	.enableWordAddress    = 0,
	.AWRSeqIndex          = 0,
	.AWRSeqNumber         = 0,
	.ARDSeqIndex          = LUT_ReadArray,
	.ARDSeqNumber         = 1,
	.AHBWriteWaitUnit     = kFLEXSPI_AhbWriteWaitUnit2AhbCycle,
	.AHBWriteWaitInterval = 0,
	.enableWriteMask      = false,
};

enum DummyCycles
{
	DummyCycles_Adesto   = 18,	// Number of dummy cycles after Read Command for Adesto-Flash
	DummyCycles_Macronix = 12,	// Number of dummy cycles after Read Command for Macronix-Flash - Set 0x04 To the Config
};

static const uint32_t LUT_SPI_Generic[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,        kFLEXSPI_1PAD, 0x0B, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_SDR,  kFLEXSPI_1PAD, 8,    kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 128),
//	(kFLEXSPI_Command_JUMP_ON_CS, kFLEXSPI_1PAD, 0,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (1) Read Status (byte 1) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x05,  kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 1),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (2) Read ID --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x9F, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 24),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets    
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x06, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x02, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 128,  kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0), 
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Sector/Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x20, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x60, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) Enter QPI mode --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x38, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers (Adesto) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x71, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 8),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (9) Write Configuration Register 2 (Macronix) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x72, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (10) Enter QPI mode - Atmel --> compare @LUT_CommandOffsets
	 FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x31, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (11) Write Status Register-2  (Winbond) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x31, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 8),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (12) Enter QPI mode - ISSI --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x38, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (13) Write Configuration Register 1 (Macronix) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x01,kFLEXSPI_Command_WRITE_SDR,  kFLEXSPI_1PAD, 1),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};

