Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
static const uint32_t LUT_QuadSPI[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x0B, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_SDR,   kFLEXSPI_4PAD, DummyCycles_Adesto, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_4PAD, 128),
//	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_JUMP_ON_CS,  kFLEXSPI_4PAD, 0,
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (1) Read Status (byte 1) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x05, kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_4PAD, 4),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_READ_SDR,    kFLEXSPI_4PAD, 0x01, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
//	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x05, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 4),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x06, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x02, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_4PAD, 128,  kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x20, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 32),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x60, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) Return to Standard SPI Mode --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0xFF, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x71, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 8),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_4PAD, 1,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};

// LUT for ISSI
static const uint32_t LUT_QuadSPI_ISSI[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0xEB, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 0x18),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_4PAD, 0x06, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_4PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	
	// (1) Read Status --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0x05, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0x06, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0x32, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 0x18),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_4PAD, 0x04, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Block Erase 4K / Sector Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0xD7, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_1PAD, 0x18),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0xC7, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),	
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) Return to Standard SPI Mode --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_4PAD, 0xF5, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	
	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_1PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};

// LUT for Atmel / Winbond
static const uint32_t LUT_QuadSPI_3[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0xEB, kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_4PAD, 0x18),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_4PAD, 0x06, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_4PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	
	// (1) Read Status --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,       kFLEXSPI_1PAD, 0x05, kFLEXSPI_Command_READ_SDR,  kFLEXSPI_1PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

