Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
	// (5) Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x20,  kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_4PAD, 32),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x60,  kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) Return to Standard SPI Mode --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0xFF,  kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_4PAD, 0x71,  kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_4PAD, 8),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_DDR,   kFLEXSPI_4PAD, 1,     kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};


static const uint32_t LUT_OctaSPI_DDR_Adesto[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x0B, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_DDR,   kFLEXSPI_8PAD,   45, kFLEXSPI_Command_READ_DDR,  kFLEXSPI_8PAD, 128),
//	[2]  = FLEXSPI_LUT_SEQ (kFLEXSPI_Command_JUMP_ON_CS,  kFLEXSPI_8PAD, 0,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (1) Read Status (byte 1) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_DUMMY_DDR, kFLEXSPI_8PAD, 16),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_READ_DDR,    kFLEXSPI_8PAD, 1,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x02, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_DDR,   kFLEXSPI_8PAD, 128,  kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 32),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x60, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) Return to Standard SPI Mode --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xFF, kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x71, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 8),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_DDR,   kFLEXSPI_8PAD, 1,    kFLEXSPI_Command_STOP,      kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Write Status/Control Registers
//	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x71, kFLEXSPI_Command_WRITE_DDR, kFLEXSPI_8PAD, 4),
};


// LookUp Table for Macronix MX25UM Octa-Flash devices in Octa configuration with DDR
// Reading seems to be broken
static const uint32_t LUT_OctaSPI_DDR_Macronix[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array	- Octa IO DT Read --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0xEE, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x11),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_DDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_DUMMY_DDR,   kFLEXSPI_8PAD, DummyCycles_Macronix),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_READ_DDR,    kFLEXSPI_8PAD, 128,  kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four

	// (1) Read Status (byte 1) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0xFA),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x00),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x00),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_DDR,   kFLEXSPI_8PAD,   40, kFLEXSPI_Command_READ_DDR,    kFLEXSPI_8PAD, 1),

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0xF9),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x12, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0xED),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_DDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_WRITE_DDR,   kFLEXSPI_8PAD, 128),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

