Masmiseim36/iMXRT/targets/iMXRT/Loader2/libmem_driver_xSPI.cpp
	// (5) Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0x21, kFLEXSPI_Command_DDR,         kFLEXSPI_8PAD, 0xDE),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_DDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x60, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x9F),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (9) Write Configuration Register 2 --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x72, kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_1PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 1,    kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};
// LookUp Table for Macronix MX25UM Octa-Flash devices in Octa configuration without DDR
static const uint32_t LUT_OctaSPI_Macronix[CUSTOM_LUT_LENGTH] =
{
	// (0) Read Array	- Octa Read --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xEC, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x13),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_DUMMY_SDR,   kFLEXSPI_8PAD, DummyCycles_Macronix),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_READ_SDR,    kFLEXSPI_8PAD, 256,  kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four

	// (1) Read Status (byte 1) --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xFA),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x00),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x00),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_DUMMY_SDR,   kFLEXSPI_8PAD,   40, kFLEXSPI_Command_READ_SDR,    kFLEXSPI_8PAD, 1),

	// (2) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (3) Write Enable --> compare @LUT_CommandOffsets  
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xF9),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (4) Page Program --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x12, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xED),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_8PAD, 128),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (5) Block Erase 4K --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x21, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0xDE),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_8PAD, 32,   kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (6) Chip Erase --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x60, kFLEXSPI_Command_SDR,         kFLEXSPI_8PAD, 0x9F),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (7) free
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (8) Write Status/Control Registers --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x01, kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 0x04),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four

	// (9) Write Configuration Register 2 --> compare @LUT_CommandOffsets
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_SDR,         kFLEXSPI_1PAD, 0x72, kFLEXSPI_Command_RADDR_SDR,   kFLEXSPI_1PAD, 32),
	FLEXSPI_LUT_SEQ (kFLEXSPI_Command_WRITE_SDR,   kFLEXSPI_1PAD, 1,    kFLEXSPI_Command_STOP,        kFLEXSPI_1PAD, 0),
	0,	// Dummy to fill a block of four
	0,	// Dummy to fill a block of four
};


// Define the structure of the Flash (Sector Count and Size)
static libmem_geometry_t geometry[] =
{ // count - size
	{0x2000, 0x1000},
	{0, 0} 
};

static status_t ReadJEDEC           (FLEXSPI_Type *base, struct DeviceInfo *Info);
static status_t EnterQuadSPIMode    (FLEXSPI_Type *base, uint32_t baseAddr, enum LUT_CommandOffsets LutOffset);
static status_t WriteEnable         (FLEXSPI_Type *base, uint32_t baseAddr);
static status_t WaitBusBusy         (FLEXSPI_Type *base);
static status_t UnprotectAll_Adesto (FLEXSPI_Type *base);
static status_t WriteRegister       (FLEXSPI_Type *base, uint32_t Address, uint8_t value, enum LUT_CommandOffsets cmd);
static status_t EraseChip           (FLEXSPI_Type *base);
static int EraseSector              (libmem_driver_handle_t *h, libmem_sector_info_t *si);
static int ProgramPage              (libmem_driver_handle_t *h, uint8_t *dest_addr, const uint8_t *src_addr);


static int libmem_ProgramPage (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
static int libmem_EraseSector (libmem_driver_handle_t *h, uint8_t *start, size_t size, uint8_t **erase_start, size_t *erase_size);
static int libmem_Flush       (libmem_driver_handle_t *h);
static int libmem_Read        (libmem_driver_handle_t *h, uint8_t *dest, const uint8_t *src, size_t size);
static uint32_t libmem_CRC32  (libmem_driver_handle_t *h, const uint8_t *start, size_t size, uint32_t crc);


static const libmem_driver_functions_t DriverFunctions =
{
	libmem_ProgramPage,
	0,
	libmem_EraseSector,
	0,
	0,
	libmem_Flush
};

static const libmem_ext_driver_functions_t DriverFunctions_Extended =
{
	0,
	libmem_Read,
	libmem_CRC32
};

#if defined FSL_FEATURE_SOC_CCM_ANALOG_COUNT && FSL_FEATURE_SOC_CCM_ANALOG_COUNT > 0
	void SetClockConfig (FLEXSPI_Type *base, uint32_t div)
	{
		switch ((uint32_t)base)
		{
			case FLEXSPI_BASE:
				CLOCK_EnableClock(kCLOCK_FlexSpi);
				CLOCK_SetMux     (kCLOCK_FlexspiMux, 0x2); // Choose PLL2 PFD2 clock as flexspi source clock.
				CLOCK_SetDiv     (kCLOCK_FlexspiDiv, div-1);
				break;
			#ifdef FLEXSPI2
			case FLEXSPI2_BASE:
				CLOCK_EnableClock(kCLOCK_FlexSpi2);
				CLOCK_SetMux     (kCLOCK_Flexspi2Mux, 0x0); // Choose PLL2 PFD2 clock as flexspi2 source clock.
				CLOCK_SetDiv     (kCLOCK_Flexspi2Div, div-1);
				break;
			#endif
			default:
				break;
		}
	}
//#else
//	void SetClockConfig (FLEXSPI_Type *base, uint32_t div)
//	{
//		(void)base;
//		BOARD_SetFlexspiClock (2, div);		// Use AUX0_PLL as clock source for the FlexSPI
//	}
#endif


LibmemStatus_t Init_AdestoXiP (FLEXSPI_Type *base, enum eMemoryType MemType, const uint32_t **lut)
{
	DebugPrint ("Found Adesto Flash\r\n");
	// Unlock all sectors
	UnprotectAll_Adesto (base);

	// Switch the configuration according to the configured memory-type
	uint8_t Status = 0;
	switch (MemType)
	{
		case MemType_OctaSPI_DDR:
			// Enter Octal-Mode with DDR.
			Status = 0x88;
			*lut = LUT_OctaSPI_DDR_Adesto;
			break;
		case MemType_OctaSPI:
			Status = 0x08;
			*lut = LUT_OctaSPI_Adesto;
			break;
		case MemType_QuadSPI_DDR:
			Status = 0x84;
			*lut = LUT_QuadSPI_DDR_Adesto;
			break;
		case MemType_QuadSPI:
			Status = 0x04;
			*lut = LUT_QuadSPI;
			break;
		case MemType_SPI:
			// don't update the LUT, we are already in SPI-mode
			Status = 0x00;
			break;
		default:
			return LibmemStaus_Error;
	}

	// send write-enable 
	status_t stat = WriteEnable (base, 0);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

	// Write to status/control register 2 to switch to chosen memory-Type
	stat = WriteRegister (base, 2, Status, LUT_WriteStatusReg_Adesto);
	if (stat != kStatus_Success)
		return LibmemStaus_Error;

